# Aula 3 - Warmup de Introdução ao Pandas

### Treinando a função Lambda

#### W3.1 Crie uma função lambda que retorne o valor do argumento multiplicado por ele mesmo

In [ ]:
# Faça aqui
f = lambda x: x*x

#### W3.2 Crie uma função lambda que retorne o último caracter de uma string passada como argumento

In [ ]:
# Faça aqui
lambda x: x[-1]

#### W3.3 Usando a função do exercício anterior, ordene a lista de strings a seguir. Ou seja, ordene pela ordem alfabética do ultimo caractere. 
#### Dica: use o argumento key da função str.sort()

In [2]:
#Considere a lista de strings abaixo
strings = ['foo', 'card', 'bar', 'aaa2222a', 'abasb']
# Ordene esta lista pelo tamanho das strings usando uma função lambda
strings.sort(key=lambda x: x[-1])
print(strings)

['aaa2222a', 'abasb', 'card', 'foo', 'bar']

### Treinando conceitos de Pandas e Series

In [3]:
# Importe as bibliotecas pandas e numpy
import pandas as pd
import numpy as np

#### W3.4 Crie um objeto Series contendo os seguintes elementos [4, 7, -5, 3]

In [4]:
# Faça aqui
pd.Series([4, 7, -5, 3])

0    4
1    7
2   -5
3    3
dtype: int64

#### W3.5 Crie um objeto Series contendo [4, 7, -5, 3] e defina seu próprio array de índices como sendo ['d', 'b', 'a', 'c']

In [6]:
# Faça aqui
s = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
print(s)

d    4
b    7
a   -5
c    3
dtype: int64

#### W3.6 Use o índice para acessar o valor 4 do objeto Series criado no exercicio W3.5

In [7]:
# Faça aqui
s['d']

4

#### W3.7 Use o índice para acessar os valores 7 e 3 do objeto Series criado no exercicio W3.5

In [8]:
# Faça aqui
s[['b', 'c']]

b    7
c    3
dtype: int64

#### W3.8 Atribua o valor 6 ao elemento de índice d

In [10]:
# Faça aqui
s['d'] = 6
print(s)

d    6
b    7
a   -5
c    3
dtype: int64

#### W3.9 Verifique se o índice 'c' está presente na Serie criada no exercício W3.5

In [12]:
# Faça aqui
'c' in s.index

True

#### W3.10 Verifique se o índice 'e' está presente na Serie criada no exercício W3.5

In [13]:
# Faça aqui
'e' in s.index

False

#### W3.11 Retorne os elementos da Series abaixo cujo valor seja maior que 0

In [14]:
# Considere a seguinte serie
obj2 = pd.Series([0, 7, -5, 3, 2, 5, -15], index=['d', 'b', 'a', 'c', 'd', 'e', 'f'])
# Faça aqui
obj2[obj2 > 0]

b    7
c    3
d    2
e    5
dtype: int64

#### W3.12 Retorne os valores da Serie obj2 (exercício W3.11) multiplicados por 2

In [15]:
# Faça aqui
obj2 * 2

d     0
b    14
a   -10
c     6
d     4
e    10
f   -30
dtype: int64

#### W3.13 Retorne os valores da aplicação da função exponencial (np.exp) a Serie obj2 (exercício W3.11)

In [16]:
# Faça aqui
np.exp(obj2)

d    1.000000e+00
b    1.096633e+03
a    6.737947e-03
c    2.008554e+01
d    7.389056e+00
e    1.484132e+02
f    3.059023e-07
dtype: float64

#### W3.14 Criando uma Serie com um dicionário. Chame a Serie de obj3.

In [19]:
# Crie uma série com o seguinte dicionário 
# {'carro': 350, 'moto': 750, 'bicicleta': 260, 'caminhao': 500, 'trem': np.nan, 'aviao': np.nan}
# Chame a Serie de obj3
# Faça aqui
obj3 = pd.Series({'carro': 350, 'moto': 750, 'bicicleta': 260, 'caminhao': 500, 'trem': np.nan, 'aviao': np.nan})
print(obj3)

carro        350.0
moto         750.0
bicicleta    260.0
caminhao     500.0
trem           NaN
aviao          NaN
dtype: float64

### Treinando conceitos de Valores Ausentes/Indisponíveis (NA)

#### W3.15 Retorne, na forma de uma serie de booleanos, quais elementos da Serie obj3 tem valores NA

In [20]:
# Faça aqui
obj3.isnull()

carro        False
moto         False
bicicleta    False
caminhao     False
trem          True
aviao         True
dtype: bool

#### W3.16 Retorne, na forma de uma serie de booleanos, quais elementos da Serie obj3 não tem valores NA

In [21]:
# Faça aqui
obj3.notnull()

carro         True
moto          True
bicicleta     True
caminhao      True
trem         False
aviao        False
dtype: bool

#### W3.17 Retorne os valores não nulos (diferentes de NA) da serie obj3

In [22]:
# Faça aqui
obj3[obj3.notnull()]

carro        350.0
moto         750.0
bicicleta    260.0
caminhao     500.0
dtype: float64

#### W3.18 Remova os elementos de valor NA da serie obj3

In [25]:
# Faça aqui
obj3 = obj3[obj3.notnull()]
print(obj3)
# solucao alternativa
obj3.dropna() # Esse metodo também tem o argumento inplace

carro        350.0
moto         750.0
bicicleta    260.0
caminhao     500.0
dtype: float64

carro        350.0
moto         750.0
bicicleta    260.0
caminhao     500.0
dtype: float64

### Treinando Aritmética com Series

#### W3.19 Crie a série abaixo

In [26]:
# Crie uma série com o seguinte dicionário 
# {'carro': 50, 'moto': 150, 'bicicleta': 200, 'caminhao': np.nan, 'trem': 10, 'aviao': 20}
# Chame a Serie de obj4
# Faça aqui
obj4 = pd.Series({'carro': 50, 'moto': 150, 'bicicleta': 200, 'caminhao': np.nan, 'trem': 10, 'aviao': 20})
obj4

carro         50.0
moto         150.0
bicicleta    200.0
caminhao       NaN
trem          10.0
aviao         20.0
dtype: float64

#### W3.20 Some as séries criadas nos dois exercícios anteriores (obj3 e obj4)

In [27]:
# Faça aqui
obj3+obj4

aviao          NaN
bicicleta    460.0
caminhao       NaN
carro        400.0
moto         900.0
trem           NaN
dtype: float64

## Treinando conceitos sobre DataFrames

#### W3.21 Crie um data frame a partir dos dados do seguinte dicionário. Chame-o de frame

In [28]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# Faça aqui
frame = pd.DataFrame(data)

#### W3.22 Mostre as primeiras linhas do dataframe frame

In [29]:
# Acesse as primeiras linhas do dataframe frame
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

#### Acesse a coluna state usando a sintaxe com colchetes

In [30]:
# Faça aqui
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

#### W3.23 Atribua o valor 16.5 para todas as posições de uma nova coluna chamada debt.

In [31]:
# Faça aqui
frame['debt'] = 16.5

#### W3.24 Atribua o valor do intervalo de 0 a 5 (float) na coluna debt.
#### Dica: use a função np.arange

In [32]:
# Faça aqui
frame['debt'] = np.arange(6.)

#### W3.25 Crie uma nova coluna chamada eastern com o valor True para as linhas cujo estado seja Ohio, e False caso contrário.

In [34]:
# Faça aqui
frame['eastern'] = frame['state'] == 'Ohio'
frame

    state  year  pop  debt  eastern
0    Ohio  2000  1.5   0.0     True
1    Ohio  2001  1.7   1.0     True
2    Ohio  2002  3.6   2.0     True
3  Nevada  2001  2.4   3.0    False
4  Nevada  2002  2.9   4.0    False
5  Nevada  2003  3.2   5.0    False

#### W3.26 Delete a coluna eastern usando o comando del

In [35]:
# Faça aqui
del frame['eastern']

#### W3.27 Crie um DataFrame a partir de um dicionário de dicionários. Chame-o de frame3.

In [36]:
# Crie um Dataframe a partir do seguinte dicionário:
pop = {'DF': {2001: 2.7, 2002: 2.8},
        'GO': {2000: 1.2, 2001: 1.7, 2002: 2.6}}
# Faça aqui
frame3 = pd.DataFrame(pop)

#### W3.28 Retorne somente os valores do dicionário frame3. 
#### Dica use o atributo values.

In [37]:
# Faça aqui
frame3.values

array([[2.7, 1.7],
       [2.8, 2.6],
       [nan, 1.2]])

#### W3.29 Remova os valores de uma Serie conforme especificado a seguir.

In [38]:
# Considere a Serie abaixo
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [41]:
# Crie um novo objeto removendo o item de índice c
objx = obj.drop('c')
objx

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [42]:
# Retorne uma serie sem os itens c e d
obj.drop(['c', 'd'])

a    0.0
b    1.0
e    4.0
dtype: float64

#### W3.30 Removendo entradas de um DataFrame conforme especificado a seguir.

In [44]:
# Considere o dataframe abaixo
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['DF', 'GO', 'SP', 'RJ'],
                    columns=['um', 'dois', 'tres', 'quatro'])
data

    um  dois  tres  quatro
DF   0     1     2       3
GO   4     5     6       7
SP   8     9    10      11
RJ  12    13    14      15

In [45]:
# Retorne um dataframe sem as linhas DF e GO
data.loc[['DF', 'GO'], :]

    um  dois  tres  quatro
DF   0     1     2       3
GO   4     5     6       7

In [46]:
# Remova a coluna tres do dataframe data. Dica: use o argumento axis do método drop.
data.drop('tres', axis=1)

    um  dois  quatro
DF   0     1       3
GO   4     5       7
SP   8     9      11
RJ  12    13      15

#### W3.31 Realize as operações solicitadas a seguir

In [47]:
# Considere o dataframe abaixo
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['DF', 'GO', 'SP', 'RJ'],
                    columns=['um', 'dois', 'tres', 'quatro'])
data

    um  dois  tres  quatro
DF   0     1     2       3
GO   4     5     6       7
SP   8     9    10      11
RJ  12    13    14      15

In [49]:
# Retorne um dataframe contendo True para itens menores que 5, e False caso contrário
data<5

       um   dois   tres  quatro
DF   True   True   True    True
GO   True  False  False   False
SP  False  False  False   False
RJ  False  False  False   False

In [50]:
# Atribua o valor zero onde os valores do dataframe são menores que 5
data[data<5] = 0
data

    um  dois  tres  quatro
DF   0     0     0       0
GO   0     5     6       7
SP   8     9    10      11
RJ  12    13    14      15

### Treinando Filtro e Seleção num dataframe
#### W3.32 Execute as instruções solicitadas a seguir.

In [51]:
# Selecione as colunas um e dois do dataframe data
data[['um', 'dois']]

    um  dois
DF   0     0
GO   0     5
SP   8     9
RJ  12    13

In [53]:
# Retorne as linhas do dataframe data cujo valor da coluna tres seja maior que 5
data[data['tres'] > 5]

    um  dois  tres  quatro
GO   0     5     6       7
SP   8     9    10      11
RJ  12    13    14      15

### Treinando seleção com os operadores loc e iloc
#### W3.33 Execute as instruções solicitadas a seguir.

In [54]:
# Retorne o subconjunto especificado pela linha DF e colunas dois e tres
data.loc['DF', ['dois','tres']]

dois    0
tres    0
Name: DF, dtype: int32

In [55]:
# Utilizando o iloc, retorne o subconjunto especificado pela linha 2 e colunas 3, 0 e 1
data.iloc[2, [3,0,1]]

quatro    11
um         8
dois       9
Name: SP, dtype: int32